** Lisp Implementation
Nodes are 1..n, ADJACENCY-LIST is an array of size n+1, where index i gives the list of nodes attached to node i.
#+name: dfs-spanning-tree
#+begin_src lisp
(defun dfs-st (adjacency-list)
  "A list of a edges in spanning tree generated by Depth-first search of the graph represented by ADJACENCY-LIST."
  (do ((stack (mapcar (lambda (n) (list n 1)) (aref adjacency-list 1)))
       (mark (let ((m (make-array (array-dimension adjacency-list 0)
                                  :element-type 'boolean
                                  :initial-element nil)))
               (prog2 (setf (aref m 1) t) m)))
       (edge-list nil))
      ((null stack) edge-list)
    (let* ((cnode (caar stack))
           (neighbours (remove-if (lambda (n) (aref mark n))
                                  (aref adjacency-list cnode))))
      (if (aref mark cnode)
          (setf stack (cdr stack))
          (setf edge-list (cons (car stack) edge-list)
                stack (append (mapcar (lambda (n) (list n cnode)) neighbours)
                              (cdr stack))
                (aref mark cnode) t)))))
#+end_src

#+name: bfs-spanning-tree
#+begin_src lisp
(defun bfs-st (adjacency-list)
  "Edges travelled when searching a graph breadth first."
  (let* ((start 0)
         (end 0)
         (q (make-array (* (1- (array-dimension adjacency-list 0))
                           (1- (array-dimension adjacency-list 0)))
                        :element-type 'list))
         (m (make-array (array-dimension adjacency-list 0)
                        :element-type 'boolean :initial-element nil)))
    (setf (aref m 1) t)
    (dolist (n (aref adjacency-list 1) q)
      (setf (aref q end) (list n 1)
            end (1+ end)))
    (do ((edge-list nil))
        ((= start end) edge-list)
      (let* ((cnode (car (aref q start)))
             (neighbours (remove-if (lambda (n) (aref m n))
                                    (aref adjacency-list cnode))))
        (when (not (aref m cnode))
          (setf edge-list (cons (aref q start) edge-list))
          (dolist (n neighbours)
            (setf (aref q end) (list n cnode)
                  end (1+ end))))
        (setf (aref m cnode) t)
        (incf start)))))
#+end_src

#+name: test-search-trees
#+begin_src lisp :noweb strip-export :exports both
<<dfs-spanning-tree>>
<<bfs-spanning-tree>>
(let ((al (make-array 7 :initial-contents '(nil
                                            (2 4 5 6)
                                            (1 4 6)
                                            (4 5)
                                            (1 2 3)
                                            (1 3 4)
                                            (1 2)))))
  (list (dfs-st al)
        (bfs-st al)))
#+end_src

#+RESULTS: test-search-trees
| (6 2) | (5 3) | (3 4) | (4 2) | (2 1) |
| (3 4) | (6 1) | (5 1) | (4 1) | (2 1) |
